venkatarajasekhar/mplab-harmony/apps/rtos/embos/basic/firmware/src/rtos_config/pic32mz_ef_sk/RTOS.h
void         OS_PIC32MZ_DCACHE_CleanRange      (void *p, OS_U32 NumBytes);
void         OS_PIC32MZ_DCACHE_InvalidateRange (void *p, OS_U32 NumBytes);
unsigned int OS_MIPS_GetFIR                   (void);
unsigned int OS_MIPS_GetFCCR                  (void);
void         OS_MIPS_SetFCCR                  (unsigned int value);
unsigned int OS_MIPS_GetFCSR                  (void);
void         OS_MIPS_SetFCSR                  (unsigned int value);

/*********************************************************************
*
*       FPU support
*/
#if ((defined __mips_hard_float) && (__mips_hard_float == 1))
  void OS_ExtendTaskContext_VFP(void);

  typedef struct {
    unsigned long long acVfpRegs[32];   // 32x double precision 64bit registers
    OS_U32 FCSR;                        //  1x 32bit control and status register
  } OS_VFP_REGS_TEMP;

  // Helper for ISR-handler: Store VFP registers onto stack
  #define OS_VFP_Save() {         \
    OS_VFP_REGS_TEMP VfpRegs;     \
    OS_VFP_SaveRegs(&VfpRegs);

  // Helper for ISR-handler: Restore VFP registers from stack
  #define OS_VFP_Restore()        \
    OS_VFP_RestoreRegs(&VfpRegs); \
  }
#endif

#ifdef __cplusplus
  }
#endif

/*********************************************************************
*
*       Global interrupt disable/enable support
*       Implemented here, using intrinsics (works for M0/M3/M4 and M4F)
*/
#define OS_INTERRUPT_MaskGlobal()    asm("di");asm("ehb");
#define OS_INTERRUPT_UnmaskGlobal()  asm("ei");asm("ehb");

#define OS_INTERRUPT_PreserveGlobal(p)  *(p) = (OS_MIPS_GetStatus() & 0x01);

#define OS_INTERRUPT_RestoreGlobal(p)   OS_MIPS_SetStatus(*(p) | OS_MIPS_GetStatus());

#define OS_INTERRUPT_PreserveAndMaskGlobal(p) *(p) = OS_MIPS_GetStatus();asm("di");asm("ehb");

/****** End of chip / compiler specific part ************************/

/*********************************************************************
*
*       Generic portion of the OS starts here
*
**********************************************************************
This file (original name OS_RAW.h) is part of RTOS.h, the include
file for the OS.
*/

/*********************************************************************
*
*       MISRA C:2012
*
**********************************************************************
*/
// PRQA S 5209 ++

#if (!defined(OS_LIBMODE_XR) && !defined(OS_LIBMODE_R)  &&   \
     !defined(OS_LIBMODE_S)  && !defined(OS_LIBMODE_SP) &&   \
     !defined(OS_LIBMODE_D)  && !defined(OS_LIBMODE_DP) &&   \
     !defined(OS_LIBMODE_DT))
#include "OS_Config.h"
#endif

#define OS_VERSION_GENERIC (41202u)       /*  Generic version 4.12b */

#ifndef   OS_PORT_REVISION
  #define OS_PORT_REVISION 0u
#endif

#define OS_VERSION (OS_VERSION_GENERIC + (OS_PORT_REVISION * 25u))


/****** Thread local storage, may be enabled in CPU specific part ***/

#ifndef   OS_SUPPORT_TLS
  #define OS_SUPPORT_TLS    0
#endif

/****** embOS software timer may be excluded when compiling sources */

#ifndef   OS_SUPPORT_TIMER
  #define OS_SUPPORT_TIMER  1
#endif

/****** embOS tickless support may be excluded when compiling sources */

#ifndef   OS_SUPPORT_TICKLESS
  #define OS_SUPPORT_TICKLESS  1
#endif

/****** embOS default debug level is 1, may be overwritten in project settings */

#ifndef   OS_DEBUG_LEVEL
  #define OS_DEBUG_LEVEL    1
#endif

/*********************************************************************
*
*       Defines for library types
*
**********************************************************************
*/

/* If library type is not selected yet (on project level,
   for example), then select DP by default
*/
#if (!defined(OS_LIBMODE_XR) && !defined(OS_LIBMODE_R)  &&   \
     !defined(OS_LIBMODE_S)  && !defined(OS_LIBMODE_SP) &&   \
     !defined(OS_LIBMODE_D)  && !defined(OS_LIBMODE_DP) &&   \
     !defined(OS_LIBMODE_DT))
#define OS_LIBMODE_DP
#endif

#if defined(OS_LIBMODE_XR)                        // Extremely small release - without Round robin support
  #define OS_CHECKSTACK_DEFAULT                0
  #define OS_DEBUG_DEFAULT                     0
  #define OS_PROFILE_DEFAULT                   0u
  #define OS_SUPPORT_TICKSTEP_DEFAULT          0
  #define OS_TRACE_DEFAULT                     0u
  #define OS_PTRACE_DEFAULT                    0u
  #define OS_RR_SUPPORTED_DEFAULT              0
  #define OS_TRACKNAME_DEFAULT                 0
  #define OS_SUPPORT_SAVE_RESTORE_HOOK_DEFAULT 0
  #define OS_CreateTask   OS_CreateTask_XR
  #define OS_CreateTaskEx OS_CreateTaskEx_XR
  #define OS_LIBMODE "XR"
  #define OS_SUPPORT_STAT_DEFAULT              0
  #define OS_SUPPORT_PTLS_DEFAULT              0
#elif defined(OS_LIBMODE_R)                       // Release build
  #define OS_CHECKSTACK_DEFAULT                0
  #define OS_DEBUG_DEFAULT                     0
  #define OS_PROFILE_DEFAULT                   0u
  #define OS_SUPPORT_TICKSTEP_DEFAULT          0
  #define OS_TRACE_DEFAULT                     0u
  #define OS_PTRACE_DEFAULT                    0u
  #define OS_RR_SUPPORTED_DEFAULT              1
  #define OS_TRACKNAME_DEFAULT                 1
  #define OS_SUPPORT_SAVE_RESTORE_HOOK_DEFAULT 1
  #define OS_CreateTask   OS_CreateTask_R
  #define OS_CreateTaskEx OS_CreateTaskEx_R
  #define OS_LIBMODE "R"
  #define OS_SUPPORT_STAT_DEFAULT              0
  #define OS_SUPPORT_PTLS_DEFAULT              OS_SUPPORT_TLS
#elif defined(OS_LIBMODE_S)                       // Release build with stack check
  #define OS_CHECKSTACK_DEFAULT                1
  #define OS_DEBUG_DEFAULT                     0
  #define OS_PROFILE_DEFAULT                   0u
  #define OS_SUPPORT_TICKSTEP_DEFAULT          0
  #define OS_TRACE_DEFAULT                     0u
  #define OS_PTRACE_DEFAULT                    0u
  #define OS_RR_SUPPORTED_DEFAULT              1
  #define OS_TRACKNAME_DEFAULT                 1
  #define OS_SUPPORT_SAVE_RESTORE_HOOK_DEFAULT 1
  #define OS_CreateTask   OS_CreateTask_S
  #define OS_CreateTaskEx OS_CreateTaskEx_S
  #define OS_LIBMODE "S"
  #define OS_SUPPORT_STAT_DEFAULT              0
  #define OS_SUPPORT_PTLS_DEFAULT              OS_SUPPORT_TLS
#elif defined(OS_LIBMODE_SP)                      // Release build with stack check and profiling
  #define OS_CHECKSTACK_DEFAULT                1
  #define OS_DEBUG_DEFAULT                     0
  #define OS_PROFILE_DEFAULT                   1u
  #define OS_SUPPORT_TICKSTEP_DEFAULT          1
  #define OS_TRACE_DEFAULT                     0u
  #define OS_PTRACE_DEFAULT                    0u
  #define OS_RR_SUPPORTED_DEFAULT              1
  #define OS_TRACKNAME_DEFAULT                 1
  #define OS_SUPPORT_SAVE_RESTORE_HOOK_DEFAULT 1
  #define OS_CreateTask   OS_CreateTask_SP
  #define OS_CreateTaskEx OS_CreateTaskEx_SP
  #define OS_LIBMODE "SP"
  #define OS_SUPPORT_STAT_DEFAULT              1
  #define OS_SUPPORT_PTLS_DEFAULT              OS_SUPPORT_TLS
#elif defined(OS_LIBMODE_D)                       // Debug build
  #define OS_CHECKSTACK_DEFAULT                1
  #define OS_DEBUG_DEFAULT                     OS_DEBUG_LEVEL
  #define OS_PROFILE_DEFAULT                   0u
  #define OS_SUPPORT_TICKSTEP_DEFAULT          1
  #define OS_TRACE_DEFAULT                     0u
  #define OS_PTRACE_DEFAULT                    0u
  #define OS_RR_SUPPORTED_DEFAULT              1
  #define OS_TRACKNAME_DEFAULT                 1
  #define OS_SUPPORT_SAVE_RESTORE_HOOK_DEFAULT 1
  #define OS_CreateTask   OS_CreateTask_D
  #define OS_CreateTaskEx OS_CreateTaskEx_D
  #define OS_LIBMODE "D"
  #define OS_SUPPORT_STAT_DEFAULT              1
  #define OS_SUPPORT_PTLS_DEFAULT              OS_SUPPORT_TLS
#elif defined(OS_LIBMODE_DP)                      // Debug build with profiling
  #define OS_CHECKSTACK_DEFAULT                1
  #define OS_DEBUG_DEFAULT                     OS_DEBUG_LEVEL
  #define OS_PROFILE_DEFAULT                   1u
  #define OS_SUPPORT_TICKSTEP_DEFAULT          1
  #define OS_TRACE_DEFAULT                     0u
  #define OS_PTRACE_DEFAULT                    0u
  #define OS_RR_SUPPORTED_DEFAULT              1
  #define OS_TRACKNAME_DEFAULT                 1
  #define OS_SUPPORT_SAVE_RESTORE_HOOK_DEFAULT 1
  #define OS_CreateTask   OS_CreateTask_DP
  #define OS_CreateTaskEx OS_CreateTaskEx_DP
  #define OS_LIBMODE "DP"
  #define OS_SUPPORT_STAT_DEFAULT              1
  #define OS_SUPPORT_PTLS_DEFAULT              OS_SUPPORT_TLS
#elif defined(OS_LIBMODE_DT)                      // Debug build with profiling and trace
  #define OS_CHECKSTACK_DEFAULT                1
  #define OS_DEBUG_DEFAULT                     OS_DEBUG_LEVEL
  #define OS_PROFILE_DEFAULT                   1u
  #define OS_SUPPORT_TICKSTEP_DEFAULT          1
  #define OS_TRACE_DEFAULT                     1u
  #define OS_PTRACE_DEFAULT                    1u
  #define OS_RR_SUPPORTED_DEFAULT              1
  #define OS_TRACKNAME_DEFAULT                 1
  #define OS_SUPPORT_SAVE_RESTORE_HOOK_DEFAULT 1
  #define OS_CreateTask   OS_CreateTask_DT
  #define OS_CreateTaskEx OS_CreateTaskEx_DT
  #define OS_LIBMODE "DT"
  #define OS_SUPPORT_STAT_DEFAULT              1
  #define OS_SUPPORT_PTLS_DEFAULT              OS_SUPPORT_TLS
#else
  #error Please define library type used !
#endif

