venkatarajasekhar/mplab-harmony/apps/rtos/embos/basic/firmware/src/rtos_config/pic32mz_ef_sk/RTOS.h
typedef enum {
  OS_EVENT_RESET_MODE_SEMIAUTO = 0 ,  // Same as previous mode, mix from automatic an manual reset
  OS_EVENT_RESET_MODE_MANUAL,         // Manual reset, event remains set when waiting task is resumed, has to be reset by task
  OS_EVENT_RESET_MODE_AUTO,           // automatic reset, event is automatically cleared when waiting task is resumed
  OS_EVENT_RESET_MODE_COUNT           // Number of modes
} OS_EVENT_RESET_MODE;

struct OS_EVENT_STRUCT {
  OS_WAIT_OBJ         WaitObj;
  OS_U8               Signaled;
  OS_EVENT_RESET_MODE ResetMode;
#if OS_DEBUG
  OS_U8 Id;
#endif
};

/**********************************************************************
*
*       OS_TRACE_ENTRY
*/
typedef struct {
  OS_U32  Time;
  void    *pCurrentTask;
  void    *p;
  OS_U32  v;
  OS_U8   iRout;
} OS_TRACE_ENTRY;


/*********************************************************************
*
*       SysTimer Config
*
**********************************************************************
*/
typedef struct  {
  OS_U32       TimerFreq;                     // e.g. 48000000 for 48MHz
  OS_U32       TickFreq;                      // typ. 1000 for 1 KHz system tick
  OS_BOOL      IsUpCounter;                   // 0: Down counter. Interrupt on underflow. 1: Up counter, interrupt on compare
  unsigned int (*pfGetTimerCycles)    (void); // Callback function for reading HW timer value
  unsigned int (*pfGetTimerIntPending)(void); // Callback function for reading timer interrupt pending state
} OS_SYSTIMER_CONFIG;

/*********************************************************************
*
*       Globals
*
**********************************************************************
*/

/*
    Handle DEFinition (storage is actually allocted) versus DEClaration
    (reference) of RTOS variables depending upon who includes this header file.
*/
#ifdef OSGLOBAL_C
  #define OS_EXTERN        /* Declare variables if included by RTOSKERN.C */
  #define OS_EXTERN_INIT(Var, Val) (Var)=(Val)  // PRQA S 3453
#else
  #define OS_EXTERN extern /* Define variables if included by anyone else */
  #define OS_EXTERN_INIT(Var, Val) (Var)  // PRQA S 3453
#endif

/*****  Mark start of memory pragma area ****************************/

/* Some compilers can not deal with memory attributes and need pragmas */
#if defined(__ghs_zda)
  #pragma ghs startzda
#endif

/********************************************************************/

typedef union {          // PRQA S 0750
  int Dummy;             // Make sure a full integer (32 bit on 32 bit CPUs) is used.
  struct {
    volatile OS_U8 Region;
    volatile OS_U8 DI;
  } Cnt;
} OS_COUNTERS;

#ifndef PENDING_DUMMY_BYTES
  #define PENDING_DUMMY_BYTES OS_U8 aDummy[2];
#endif

typedef union {          // PRQA S 0750
  OS_U32 All;            // Make sure a full integer (32 bit on 32 bit CPUs) is used.
  struct {
    OS_U8 RoundRobin;
    OS_U8 TaskSwitch;
    PENDING_DUMMY_BYTES
  } Flag;
} OS_PENDING;

typedef struct {
  //
  // Specific Trace Events
  //
  void (*pfRecordEnterISR)           (void);
  void (*pfRecordExitISR)            (void);
  void (*pfRecordExitISRToScheduler) (void);
  void (*pfRecordTaskInfo)           (const OS_TASK* pTask);
  void (*pfRecordTaskCreate)         (unsigned TaskId);
  void (*pfRecordTaskStartExec)      (unsigned TaskId);
  void (*pfRecordTaskStopExec)       (void);
  void (*pfRecordTaskStartReady)     (unsigned TaskId);
  void (*pfRecordTaskStopReady)      (unsigned TaskId, unsigned Reason);
  void (*pfRecordIdle)               (void);
  //
  // Generic Trace Event logging
  //
  void   (*pfRecordVoid)  (unsigned Id);
  void   (*pfRecordU32)   (unsigned Id, OS_U32 Para0);
  void   (*pfRecordU32x2) (unsigned Id, OS_U32 Para0, OS_U32 Para1);
  void   (*pfRecordU32x3) (unsigned Id, OS_U32 Para0, OS_U32 Para1, OS_U32 Para2);
  void   (*pfRecordU32x4) (unsigned Id, OS_U32 Para0, OS_U32 Para1, OS_U32 Para2, OS_U32 Para3);
  OS_U32 (*pfPtrToId)     (OS_U32 Ptr);
} OS_TRACE_API;

void OS_SetTraceAPI(const OS_TRACE_API * pTraceAPI);


struct OS_GLOBAL_STRUCT {
  OS_COUNTERS       Counters;
  OS_PENDING        Pending;
  OS_TASK      *    pCurrentTask;      // Pointer to current Task
#if OS_SUPPORT_INT_PRIORITY
  OS_IPL_DI_TYPE    Ipl_DI;
  OS_IPL_EI_TYPE    Ipl_EI;
#endif
  OS_TASK      *    pTask;             // Linked list of all Tasks
  OS_TASK volatile * volatile pActiveTask;
#if OS_SUPPORT_TIMER
  OS_TIMER     *    pTimer;            // Linked list of all active Timers
  OS_TIMER     *    pCurrentTimer;     // Actual expired timer which called callback
  OS_TIMER_HANDLER* pfCheckTimer;      // Timer handler function, set when OS_StartTimer() is called
#endif // OS_SUPPORT_TIMER
  volatile          OS_I32 Time;
  OS_TIME           TimeDex;
#ifdef OS_U64
  OS_U64            TickCnt;
#endif
#if OS_RR_SUPPORTED
  OS_U8             TimeSlice;
  OS_U8             TimeSliceAtStart;
#endif
#if OS_SUPPORT_TICKLESS
  OS_TIME           TicklessFactor;
  OS_BOOL           TicklessExpired;
  voidRoutine       *pfEndTicklessMode;
#endif
#if OS_PROFILE
  const OS_TRACE_API* pTrace;
  OS_U8             ProfilingOn;  
#endif
#if OS_DEBUG || OS_TRACE
  OS_U8             InInt;             // Used in Debug builds of embOS only
#endif
};

/* Translation macros for compatibility with older versions */
#define OS_pTask         OS_Global.pTask
#define OS_pCurrentTask  OS_Global.pCurrentTask
#define OS_pActiveTask   OS_Global.pActiveTask
#define OS_pTimer        OS_Global.pTimer
#define OS_pCurrentTimer OS_Global.pCurrentTimer
#define OS_Counters      OS_Global.Counters
#define OS_Pending       OS_Global.Pending
#define OS_Ipl_DI        OS_Global.Ipl_DI
#define OS_Ipl_EI        OS_Global.Ipl_EI
#define OS_Time          OS_Global.Time
#define OS_TimeDex       OS_Global.TimeDex
#if OS_RR_SUPPORTED
  #define OS_TimeSlice           OS_Global.TimeSlice
  #define OS_TimeSliceAtStart    OS_Global.TimeSliceAtStart
#endif

#if OS_COMPILER_STORAGE_MODIFIER_LEFT  /* default */

  OS_EXTERN OS_SADDR  OS_U8    OS_EXTERN_INIT(OS_IntMSInc, 1u);  // PRQA S 3406
  OS_EXTERN OS_SADDR  volatile OS_U8  OS_Status;  // PRQA S 3406
  OS_EXTERN OS_SADDR  OS_BOOL  OS_Running;  // PRQA S 3406
  OS_EXTERN OS_SADDR  OS_U8    OS_InitialSuspendCnt;  // PRQA S 3406

  #if OS_SUPPORT_TICKSTEP
    OS_EXTERN OS_SADDR  volatile OS_U8   OS_TickStep;  // PRQA S 3406 
    OS_EXTERN OS_SADDR  volatile int     OS_TickStepTime;  // PRQA S 3406
  #endif
  OS_EXTERN OS_SADDR        OS_UINT OS_TicksPerMS;  // PRQA S 3406
  OS_EXTERN OS_SADDR        int     OS_IntTicksInc;  // PRQA S 3406
  #if OS_PROFILE
    OS_EXTERN OS_SADDR OS_U32 OS_TS_ExecStart;  // PRQA S 3406
  #endif
  #if OS_DEBUG
    OS_EXTERN OS_SADDR OS_U8 OS_InTimer;  // PRQA S 3406
    OS_EXTERN OS_SADDR OS_U8 OS_InitCalled;  // PRQA S 3406
  #endif

  #if OS_SUPPORT_POWER
    OS_EXTERN OS_SADDR OS_U8 OS_POWER_Levels[OS_POWER_NUM_COUNTERS];  // PRQA S 3406
  #endif

  /****** Variables for CPU load measurement are declared global. This allows showing them in a debugger ****/
  OS_EXTERN OS_SADDR volatile OS_INT OS_CPU_Load;  // PRQA S 3406
  OS_EXTERN OS_SADDR volatile OS_I32 OS_IdleCnt;  // PRQA S 3406

