venkatarajasekhar/mplab-harmony/apps/rtos/embos/basic/firmware/src/rtos_config/pic32mz_ef_sk/RTOS.h
#define OS_TASKID OS_TASK *
#define OS_GetTaskID() OS_Global.pCurrentTask

#define OS_GetpCurrentTask()    OS_Global.pCurrentTask
#define OS_IsRunning()          OS_Running

OS_BOOL OS_InInterrupt(void);

#if OS_SUPPORT_TIMER
  #define OS_GetpCurrentTimer()   OS_Global.pCurrentTimer
  #define OS_GetpCurrentTimerEx() ((OS_TIMER_EX*)OS_Global.pCurrentTimer)
#endif  // OS_SUPPORT_TIMER

#if OS_TRACKNAME
  OS_ROM_DATA const char* OS_GetTaskName(OS_CONST_PTR OS_TASK OS_TCBPTR *pTask);
#else
  #define OS_GetTaskName(pt)  ("n/a")
#endif

#if OS_CHECKSTACK
  void              OS_CheckStack(void);              /* internal usage */
  unsigned int      OS_GetStackSpace(OS_CONST_PTR OS_TASK OS_TCBPTR *pTask);
  unsigned int      OS_GetStackUsed (OS_CONST_PTR OS_TASK OS_TCBPTR *pTask);
  unsigned int      OS_GetStackSize (OS_CONST_PTR OS_TASK OS_TCBPTR *pTask);
  void OS_STACKPTR* OS_GetStackBase (OS_CONST_PTR OS_TASK OS_TCBPTR *pTask);
#else
  #define OS_CheckStack()
  #define OS_GetStackSpace(pt) 0u
  #define OS_GetStackUsed(pt)  0u
  #define OS_GetStackSize(pt)  0u
  #define OS_GetStackBase(pt)  0u
#endif

#if OS_SUPPORT_SYSSTACK_INFO  // PRQA S 3332
  void OS_STACKPTR* OS_GetSysStackBase (void); /* RTOS asm part or OS_StackInfo.c */
  unsigned int      OS_GetSysStackSize (void); /* RTOS asm part or OS_StackInfo.c */
#else
  #define OS_GetSysStackBase()   0
  #define OS_GetSysStackSize()   0u
#endif

#if OS_CHECKSTACK && OS_SUPPORT_SYSSTACK_INFO  // PRQA S 3332
  unsigned int OS_GetSysStackSpace(void); /* OS_SysStackInfo.c               */
  unsigned int OS_GetSysStackUsed (void); /* OS_SysStackInfo.c               */
#else
  #define OS_GetSysStackSpace()  0u
  #define OS_GetSysStackUsed()   0u
#endif

#if OS_SUPPORT_INTSTACK_INFO  // PRQA S 3332
  void OS_STACKPTR* OS_GetIntStackBase(void);  /* RTOS asm part or OS_StackInfo.c */
  unsigned int      OS_GetIntStackSize(void);  /* RTOS asm part or OS_StackInfo.c */
#else
  #define OS_GetIntStackBase()   0
  #define OS_GetIntStackSize()   0u
#endif

#if OS_CHECKSTACK && OS_SUPPORT_INTSTACK_INFO  // PRQA S 3332
  unsigned int OS_GetIntStackSpace(void); /* OS_IntStackInfo.c               */
  unsigned int OS_GetIntStackUsed (void); /* OS_IntStackInfo.c               */
#else
  #define      OS_GetIntStackSpace()  0u
  #define      OS_GetIntStackUsed()   0u
#endif

#if OS_RR_SUPPORTED
  OS_U8 OS_SetTimeSlice(OS_TASK * pTask, OS_U8 TimeSlice);
  OS_U8 OS_GetTimeSliceRem(OS_CONST_PTR OS_TASK OS_TCBPTR * pTask);
  #define OS_GetTimeSliceReload(pTask)  (pTask)->TimeSliceReload  // PRQA S 3453
#else
  #define OS_GetTimeSliceRem(pTask)     0u
  #define OS_GetTimeSliceReload(pTask)  0u
#endif

OS_PRIO OS_GetPriority(OS_CONST_PTR OS_TASK * pTask);  /* OS_GetPrio.c       */
#define OS_GET_PRIORITY(pt) (pt)->Priority  // PRQA S 3453

int     OS_GetNumTasks(void);              /* OS_GetNumTasks.c   */

OS_TASK* OS_TaskIndex2Ptr(int TaskIndex);  /* OS_TaskIndex2Ptr.c */

#if OS_PROFILE >=1
  OS_U32 OS_STAT_GetExecTime_Cycles (const OS_TASK *pTask); /* OSStat.c   */
  int    OS_STAT_GetLoad            (const OS_TASK *pTask); /* OSStatGL.c */
  void   OS_STAT_NotifyReadyStart   (OS_TASK *pTask);  /* OSStat.c   */
  void   OS_STAT_Sample             (void);            /* OSStat.c   */
  void   OS_STAT_Enable             (void);
  void   OS_STAT_Disable            (void);
  OS_U32 OS_STAT_GetTaskExecTime    (const OS_TASK *pTask);
#else
  #define OS_STAT_NotifyExecEnd()
  #define OS_STAT_GetExecTime_Cycles(pTask)   0u
  #define OS_STAT_GetLoad(pTask)              0
  #define OS_STAT_Sample()
  #define OS_STAT_SetClocksPerUnit(ClocksPerUnit)
  #define OS_STAT_NOTIFYREADYSTART(pTask)
#endif


#if OS_SUPPORT_STAT
  OS_U32 OS_STAT_GetNumActivations  (const OS_TASK *pTask);  /* OSStat.c   */
  OS_U32 OS_STAT_GetNumPreemptions  (const OS_TASK *pTask);  /* OSStat.c   */
#else
  #define OS_STAT_GetNumActivations(pTask)    0u
  #define OS_STAT_GetNumPreemptions(pTask)    0u
#endif

/*********************************************************************
*
*       Size info routines (OS_GetSize.c)
*
**********************************************************************
*/

int OS_WAIT_OBJ_GetSize(void);
int OS_WAIT_OBJ_EX_GetSize(void);
int OS_WAIT_LIST_GetSize(void);
int OS_EXTEND_TASK_CONTEXT_GetSize(void);
int OS_TASK_GetSize(void);
int OS_REGS_GetSize(void);
int OS_TICK_HOOK_GetSize(void);
int OS_RSEMA_GetSize(void);
int OS_CSEMA_GetSize(void);
int OS_MAILBOX_GetSize(void);
int OS_Q_GetSize(void);
int OS_MEMF_GetSize(void);
int OS_EVENT_GetSize(void);
int OS_TRACE_ENTRY_GetSize(void);

#if OS_SUPPORT_TIMER
  int OS_TIMER_GetSize(void);
  int OS_TIMER_EX_GetSize(void);
#endif

/*********************************************************************
*
*       Critical regions (OsKern.c)
*
**********************************************************************
*/

//
// For some GCC compiler it is necessary to use an OS_EnterRegion() function
// instead of the macro. To do so please add the following line to OSCHIP.h:
// #define OS_EnterRegion OS_EnterRegionFunc
//
#ifndef OS_EnterRegion
  #if OS_DEBUG > 1
    #define OS_EnterRegion() {if (OS_RegionCnt == 0xFF) OS_Error(OS_ERR_REGIONCNT); else OS_RegionCnt++; }
  #else
    #define OS_EnterRegion() {OS_RegionCnt++; }
  #endif
#endif

//
// For some compiler (e.g. IAR EWRX with optimization) it is necessary to use an OS_EnterRegion() function
// instead of the macro for OS_EnterNestableInterrupt(). To do so please add the following line to OSCHIP.h:
// #define OS_IntEnterRegion OS_EnterRegionFunc
//
#ifndef   OS_IntEnterRegion
  #define OS_IntEnterRegion() {OS_RegionCnt++;}
#endif

void OS_EnterRegionFunc(void);           /* in OS_EnterRegionFunc.c */
void OS_LeaveRegion(void);

/*********************************************************************
*
*       Interrupt save/disable/restore macros
*
**********************************************************************
*/

#define OS_IncDI()       { OS_ASSERT_DICnt(); OS_DI(); OS_DICnt++; }
#define OS_DecRI()       { OS_ASSERT_DICnt();                                      \
                           OS_DICnt--;                                             \
                           if (OS_DICnt == 0u) { /*lint !e548 No else required*/   \
                             OS_EI();                                              \
                           }                                                       \
                         }

