venkatarajasekhar/mplab-harmony/apps/rtos/embos/basic/firmware/src/rtos_config/pic32mz_ef_sk/RTOS.h
  #define OS_EnterNestableInterrupt() { \
    OS_MARK_IN_ISR();                   \
    OS_IntEnterRegion();                \
    OS_ENABLE_INTS_SAVE_IPL();          \
    OS_ASSERT_CPU_IN_ISR_MODE();        \
  }

  #define OS_LeaveNestableInterrupt() { \
    OS_DI_ON_LEAVE_NESTABLE();          \
    OS_SWITCH_FROM_INT_IF_REQUIRED()    \
    OS_HANDLE_REGION_CNT_ON_LI();       \
    OS_RESTORE_IPL();                   \
    OS_EI_ON_LEAVE_NESTABLE();          \
  }

  #define OS_LeaveNestableInterruptNoSwitch() { \
    OS_DI();                                    \
    OS_MARK_OUTOF_ISR();                        \
    OS_RegionCnt--;                             \
    OS_RESTORE_IPL();                           \
    OS_EI_ON_LEAVE_NESTABLE();                  \
  }
#endif

#ifndef OS_EnterIntStack
  void OS__EnterIntStack(void);
  #define OS_EnterIntStack() {OS_DI(); OS__EnterIntStack(); OS_RESTORE_I(); }
#endif

#ifndef OS_LeaveIntStack
  void OS__LeaveIntStack(void);
  #define OS_LeaveIntStack() {OS_DI(); OS__LeaveIntStack(); }
#endif

void OS_SetFastIntPriorityLimit(OS_UINT Priority);

#if OS_DEBUG
  void OS_AssertCPUInISRMode(void);                   /* OSKern.c   */
#endif



/*********************************************************************
*
*       Resource semaphores
*
**********************************************************************
*/

int      OS_Use             (OS_RSEMA * pRSema);                  /* OSRsem.c      */
int      OS_UseTimed        (OS_RSEMA * pRSema, OS_TIME TimeOut); /* OS_UseTimed.c */
void     OS_Unuse           (OS_RSEMA * pRSema);                  /* OSRsem.c      */
char     OS_Request         (OS_RSEMA * pRSema);                  /* OSRsemRQ.c    */
int      OS_GetSemaValue    (OS_CONST_PTR OS_RSEMA * pRSema);     /* OSRSemGV.c    */
OS_TASK* OS_GetResourceOwner(OS_CONST_PTR OS_RSEMA * pRSema);     /* OSRsemGO.c    */

void     OS_CreateRSema     (OS_RSEMA * pRSema);                  /* OSRsem.c      */
void     OS_DeleteRSema     (OS_RSEMA * pRSema);                  /* OSDelRS.c     */

#define  OS_CREATERSEMA(ps) OS_CreateRSema(ps)  // PRQA S 3453

/*********************************************************************
*
*       Counting semaphores
*
**********************************************************************
*/

void    OS_CreateCSema    (OS_CSEMA * pCSema, OS_UINT InitValue);  /* OSCSEM.c             */
void    OS_DeleteCSema    (OS_CSEMA * pCSema);                     /* OSDELCS.c            */
int     OS_GetCSemaValue  (OS_CONST_PTR OS_CSEMA *pCSema);         /* OSCSEMGV.c           */
OS_U8   OS_SetCSemaValue  (OS_CSEMA * pCSema, OS_UINT Value);      /* OS_SetCSemaValue.c   */
void    OS_SignalCSema    (OS_CSEMA * pCSema);                     /* OSCSEM.c             */
void    OS_SignalCSemaMax (OS_CSEMA * pCSema, OS_UINT MaxValue);   /* OS_CSEMA_SignalMax.c */
void    OS_WaitCSema      (OS_CSEMA * pCSema);                     /* OSCSEM.c             */
OS_BOOL OS_WaitCSemaTimed (OS_CSEMA * pCSema, OS_TIME TimeOut);    /* OSCSEMT.c            */
OS_BOOL OS_CSemaRequest   (OS_CSEMA * pCSema);                     /* OSCSEMRQ.c           */

#define OS_CREATECSEMA(ps) OS_CreateCSema((ps), 0)  // PRQA S 3453

/*********************************************************************
*
*       Mailboxes
*
**********************************************************************
*/
void OS_CreateMB          (OS_MAILBOX * pMB, OS_U16 sizeofMsg, OS_UINT maxnofMsg, void* Buffer);    /* initialize mailbox */
void OS_ClearMB           (OS_MAILBOX * pMB);
void OS_PutMail           (OS_MAILBOX * pMB, OS_CONST_PTR void* pMail);
char OS_PutMailCond       (OS_MAILBOX * pMB, OS_CONST_PTR void* pMail);
void OS_PutMailFront      (OS_MAILBOX * pMB, OS_CONST_PTR void* pMail);
char OS_PutMailFrontCond  (OS_MAILBOX * pMB, OS_CONST_PTR void* pMail);
void OS_PutMail1          (OS_MAILBOX * pMB, OS_CONST_PTR char* pMail);
char OS_PutMailCond1      (OS_MAILBOX * pMB, OS_CONST_PTR char* pMail);
void OS_PutMailFront1     (OS_MAILBOX * pMB, OS_CONST_PTR char* pMail);
char OS_PutMailFrontCond1 (OS_MAILBOX * pMB, OS_CONST_PTR char* pMail);
void OS_GetMail           (OS_MAILBOX * pMB, void* pDest);
char OS_GetMailCond       (OS_MAILBOX * pMB, void* pDest);
void OS_GetMail1          (OS_MAILBOX * pMB, char* pDest);
char OS_GetMailCond1      (OS_MAILBOX * pMB, char* pDest);
char OS_GetMailTimed      (OS_MAILBOX * pMB, void* pDest, OS_TIME Timeout);
void OS_DeleteMB          (OS_MAILBOX * pMB);
char OS_PeekMail          (OS_CONST_PTR OS_MAILBOX * pMB, void* pDest);
void OS_WaitMail          (OS_MAILBOX * pMB);
char OS_WaitMailTimed     (OS_MAILBOX * pMB, OS_TIME Timeout);
void OS_Mail_GetPtr       (OS_MAILBOX *pMB, void **ppDest);
char OS_Mail_GetPtrCond   (OS_MAILBOX *pMB, void **ppDest);
void OS_Mail_Purge        (OS_MAILBOX *pMB);

#if OS_DEBUG == 0
  #define OS_GetMessageCnt(pMB) (*(pMB)).nofMsg
#else
  OS_UINT OS_GetMessageCnt(const OS_MAILBOX *pMB);   /* get no. of available Messages */
#endif

/*********************************************************************
*
*       Message Queues (OSQ.c)
*
**********************************************************************
*/

void    OS_Q_Create        (OS_Q* pQ, void*pData, OS_UINT Size);
void    OS_Q_Clear         (OS_Q* pQ);                                /* OSQCL.c  */
void    OS_Q_Delete        (OS_Q* pQ);                                /* OSQDEL.c */
int     OS_Q_GetMessageCnt (OS_CONST_PTR OS_Q* pQ);                   /* OSQGMC.c */
int     OS_Q_Put           (OS_Q* pQ, OS_CONST_PTR void* pSrc, OS_UINT Size);
void    OS_Q_PutBlocked    (OS_Q* pQ, OS_CONST_PTR void* pSrc, OS_UINT Size);
char    OS_Q_PutTimed      (OS_Q* pQ, OS_CONST_PTR void* pSrc, OS_UINT Size, OS_TIME Timeout);
int     OS_Q_GetPtr        (OS_Q* pQ, void**ppData);
int     OS_Q_GetPtrCond    (OS_Q* pQ, void**ppData);                  /* OSQGPC.c */
int     OS_Q_GetPtrTimed   (OS_Q* pQ, void**ppData, OS_TIME Timeout); /* OSQGPT.c */
void    OS_Q_Purge         (OS_Q* pQ);
OS_BOOL OS_Q_IsInUse       (OS_CONST_PTR OS_Q* pQ);
int     OS_Q_GetMessageSize(OS_CONST_PTR OS_Q* pQ);
int     OS_Q_PeekPtr       (OS_CONST_PTR OS_Q* pQ, void**ppData);

#define OS_Q_SIZEOF_HEADER (sizeof(OS_INT))

/*********************************************************************
*
*       Events
*
**********************************************************************
*/

