venkatarajasekhar/mplab-harmony/apps/rtos/embos/basic/firmware/src/rtos_config/pic32mz_ef_sk/RTOS.h
OS_TASK_EVENT OS_ClearEvents          (OS_TASK * pTask);                          /* OSEVENCL.c  */
OS_TASK_EVENT OS_GetEventsOccurred    (OS_CONST_PTR OS_TASK * pTask);             /* OSEVENGE.c  */
void          OS_SignalEvent          (OS_TASK_EVENT Event, OS_TASK * pTask);     /* OSENENS.c   */
OS_TASK_EVENT OS_WaitEvent            (OS_TASK_EVENT EventMask);                  /* OSEVENW.c   */
OS_TASK_EVENT OS_WaitEventTimed       (OS_TASK_EVENT EventMask, OS_TIME TimeOut); /* OSEVENT.c   */
OS_TASK_EVENT OS_WaitSingleEvent      (OS_TASK_EVENT EventMask);                  /* OSEVENWS.c  */
OS_TASK_EVENT OS_WaitSingleEventTimed (OS_TASK_EVENT EventMask, OS_TIME TimeOut); /* OSEVENWST.c */

/*********************************************************************
*
*       Timers(OSTIME.c)
*
**********************************************************************
*/

#if OS_SUPPORT_TIMER

#ifdef OS_SIZEOF_INT
  #if OS_SIZEOF_INT == 2
    #define OS_TIMER_MAX_TIME 0x7F00
  #elif OS_SIZEOF_INT == 4
    #define OS_TIMER_MAX_TIME 0x7FFFFF00
  #else
    #error "OS_SIZEOF_INT not correctly defined"
  #endif
#endif

void    OS_CreateTimer    (OS_TIMER * pTimer, OS_TIMERROUTINE* Callback, OS_TIME Timeout);
void    OS_RetriggerTimer (OS_TIMER * pTimer);
void    OS_StartTimer     (OS_TIMER * pTimer);
void    OS_StopTimer      (OS_TIMER * pTimer);
void    OS_DeleteTimer    (OS_TIMER * pTimer);                  /* OSTIMED.c  */
OS_TIME OS_GetTimerPeriod (OS_CONST_PTR OS_TIMER * pTimer);     /* OSTIMEGP.c */
OS_BOOL OS_GetTimerStatus (OS_CONST_PTR OS_TIMER * pTimer);     /* OSTIMEGS.c */
OS_TIME OS_GetTimerValue  (OS_CONST_PTR OS_TIMER * pTimer);     /* OSTIMEGV.c */
void    OS_SetTimerPeriod (OS_TIMER * pTimer, OS_TIME Period);  /* OSTIMES.c  */

#define OS_CREATETIMER(pTimer,c,d)          \
        OS_CreateTimer((pTimer), (c), (d)); \
        OS_StartTimer(pTimer);

/*********************************************************************
*
*       Extended timers (OSTIMERX.c)
*
**********************************************************************
*/
void    OS_CreateTimerEx (OS_TIMER_EX * pTimerEx, OS_TIMER_EX_ROUTINE* Callback, OS_TIME Timeout, void * pData);

#define OS_RetriggerTimerEx(pTimerEx)         OS_RetriggerTimer(&(pTimerEx)->Timer)           // PRQA S 3453
#define OS_StartTimerEx(pTimerEx)             OS_StartTimer(&(pTimerEx)->Timer)               // PRQA S 3453
#define OS_StopTimerEx(pTimerEx)              OS_StopTimer(&(pTimerEx)->Timer)                // PRQA S 3453
#define OS_DeleteTimerEx(pTimerEx)            OS_DeleteTimer(&(pTimerEx)->Timer)              // PRQA S 3453
#define OS_GetTimerPeriodEx(pTimerEx)         OS_GetTimerPeriod(&(pTimerEx)->Timer)           // PRQA S 3453
#define OS_GetTimerStatusEx(pTimerEx)         OS_GetTimerStatus(&(pTimerEx)->Timer)           // PRQA S 3453
#define OS_GetTimerValueEx(pTimerEx)          OS_GetTimerValue(&(pTimerEx)->Timer)            // PRQA S 3453
#define OS_SetTimerPeriodEx(pTimerEx,Period)  OS_SetTimerPeriod(&(pTimerEx)->Timer, (Period)) // PRQA S 3453

#define OS_CREATETIMER_EX(pTimerEx,cb,Timeout,pData)            \
        OS_CreateTimerEx((pTimerEx), (cb), (Timeout), (pData)); \
        OS_StartTimerEx(pTimerEx)

#endif // OS_SUPPORT_TIMER

/*********************************************************************
*
*       Heap type memory management (OS_Alloc.c)
*
**********************************************************************

  This functions might not be implemented in all OS ports.
  Therefore declaration depends on condition OS_SUPPORT_OS_ALLOC
  which has to be defined in CPU specific part

*/

#if OS_SUPPORT_OS_ALLOC
  void* OS_malloc   (unsigned int Size);
  void  OS_free     (void* pMemBlock);
  void* OS_realloc  (void* pMemBlock, unsigned int NewSize);
#endif

/*********************************************************************
*
*       Fixed Block memory management
*
**********************************************************************
*/

void    OS_MEMF_Create           (OS_MEMF* pMEMF, void* pPool, OS_UINT NumBlocks, OS_UINT BlockSize);
void    OS_MEMF_Delete           (OS_MEMF* pMEMF);
void*   OS_MEMF_Alloc            (OS_MEMF* pMEMF, int Purpose);
void*   OS_MEMF_AllocTimed       (OS_MEMF* pMEMF, OS_TIME Timeout, int Purpose);
void*   OS_MEMF_Request          (OS_MEMF* pMEMF, int Purpose);
void    OS_MEMF_Release          (OS_MEMF* pMEMF, void* pMemBlock);
void    OS_MEMF_FreeBlock        (void* pMemBlock);
int     OS_MEMF_GetNumFreeBlocks (OS_CONST_PTR OS_MEMF* pMEMF);
OS_BOOL OS_MEMF_IsInPool         (OS_CONST_PTR OS_MEMF* pMEMF, OS_CONST_PTR void* pMemBlock);
int     OS_MEMF_GetMaxUsed       (OS_CONST_PTR OS_MEMF* pMEMF);
int     OS_MEMF_GetNumBlocks     (OS_CONST_PTR OS_MEMF* pMEMF);
int     OS_MEMF_GetBlockSize     (OS_CONST_PTR OS_MEMF* pMEMF);

/*********************************************************************
*
*       Event object module
*
**********************************************************************
*/

/****** Simple OS_EVENT functions ************************************/

void                OS_EVENT_Create      (OS_EVENT* pEvent);
void                OS_EVENT_CreateEx    (OS_EVENT* pEvent, OS_EVENT_RESET_MODE ResetMode);
void                OS_EVENT_Delete      (OS_EVENT* pEvent);
OS_BOOL             OS_EVENT_Get         (OS_CONST_PTR OS_EVENT* pEvent);
OS_EVENT_RESET_MODE OS_EVENT_GetResetMode(const OS_EVENT* pEvent);
void                OS_EVENT_Pulse       (OS_EVENT* pEvent);
void                OS_EVENT_Reset       (OS_EVENT* pEvent);
void                OS_EVENT_Set         (OS_EVENT* pEvent);
void                OS_EVENT_SetResetMode(OS_EVENT* pEvent, OS_EVENT_RESET_MODE ResetMode);
void                OS_EVENT_Wait        (OS_EVENT* pEvent);
char                OS_EVENT_WaitTimed   (OS_EVENT* pEvent, OS_TIME Timeout);

/*********************************************************************
*
*       Timing support (OSTiming.c)
*
**********************************************************************

