venkatarajasekhar/mplab-harmony/apps/rtos/embos/basic/firmware/src/rtos_config/pic32mz_ef_sk/RTOS.h
 New in V3.04, but not yet documented to the end user. Great for
 run-time measurement.
*/

#define OS_TIMING OS_U32
void    OS_Timing_Start(OS_TIMING* pCycle);
void    OS_Timing_End(OS_TIMING* pCycle);
OS_U32  OS_Timing_Getus(OS_CONST_PTR OS_TIMING* pCycle);
#define OS_Timing_GetCycles(pPara) (*(pPara))  // PRQA S 3453

OS_TIME OS_GetNumIdleTicks(void);                              /* OS_GetNumIdleTicks.c */
void    OS_AdjustTime(OS_TIME Time);                           /* OS_AdjustTime.c      */
void    OS_StartTicklessMode(OS_TIME Time, voidRoutine *Callback); /* OS_Tickless.c        */
void    OS_StopTicklessMode(void);                             /* OS_Tickless.c        */                           

/*********************************************************************
*
*       OS Power control module OS_Power.c
*
**********************************************************************
*/
#if OS_SUPPORT_POWER
#define OS_POWER_LEVEL0  (0x0001)
#define OS_POWER_LEVEL1  (0x0002)
#define OS_POWER_LEVEL2  (0x0004)
#define OS_POWER_LEVEL3  (0x0008)
#define OS_POWER_LEVEL4  (0x0010)
#define OS_POWER_LEVEL5  (0x0020)
#define OS_POWER_LEVEL6  (0x0040)
#define OS_POWER_LEVEL8  (0x0080)

void    OS_POWER_UsageInc(OS_UINT Index);
void    OS_POWER_UsageDec(OS_UINT Index);
OS_UINT OS_POWER_GetMask(void);
#endif

/*********************************************************************
*
*       CPU load measurement
*
**********************************************************************
*/

void OS_AddLoadMeasurement(int Period, OS_U8 AutoAdjust, OS_I32 DefaultMaxValue);
int  OS_GetLoadMeasurement(void);

#if (OS_U32_OP_IS_ATOMIC == 0)
  #define OS_INC_IDLE_CNT() \
  {                         \
    OS_DI();                \
    OS_IdleCnt++;           \
    OS_RESTORE_I();         \
  }
#else
  #define OS_INC_IDLE_CNT() (OS_IdleCnt++)
#endif

/*********************************************************************
*
*       Advanced profiling support (Module OsKern.c)
*
**********************************************************************
*/
#if OS_PROFILE >= 1
  void OS_EnableProfiling(int Period);
  #define OS_DisableProfiling() { OS_ProfilingOn=0; }
#else
  #define OS_EnableProfiling(Period);
  #define OS_DisableProfiling()
#endif

/*********************************************************************
*
*       OS_TICK_HANDLE and sub-macros
*
**********************************************************************
*/
#if ((OS_U32_OP_IS_ATOMIC == 0) || (OS_PTR_OP_IS_ATOMIC == 0))
  #define OS_SET_TIME(t)      \
    {                         \
      OS_DI();                \
      OS_Global.Time = t;     \
      OS_RESTORE_I();         \
    }
#else
  #define OS_SET_TIME(t)    OS_Global.Time = (t);
#endif

#if OS_RR_SUPPORTED
  #define OS_HANDLE_RR()                        \
    if (OS_TimeSlice) {                         \
      if (--OS_TimeSlice==0) {                  \
        OS_Global.Pending.Flag.RoundRobin = 1;  \
      }                                         \
    }
#else
  #define OS_HANDLE_RR()
#endif

#if OS_SUPPORT_TICK_HOOK
  #define OS_HANDLE_TICK_HOOK()               \
  {                                           \
    OS_TICK_HOOK* pHook;                      \
    pHook = OS_pTickHook;                     \
    while (pHook) {                           \
      (*(pHook->pfUser))();                   \
      pHook = pHook->pNext;                   \
    }                                         \
  }
#else
  #define OS_HANDLE_TICK_HOOK()
#endif

#define OS_TICK_HANDLE() {                                                                   \
  OS_I32        Time;                                                                        \
  OS_ASSERT_INT();            /* Ensure OS_EnterInterrupt() or related was called */            \
  Time = OS_Global.Time + 1;  /* Compute new OS_Time */                                         \
  OS_SET_TIME(Time);          /* Update the global time variable as atomic operation */         \
  if ( OS_SUB_TIME((OS_TIME)Time, OS_Global.TimeDex) >= 0) {  /* Check if the delay is expired */   \
    OS_Global.Pending.Flag.Taskswitch = 1;                                                   \
  }                                                                                          \
  OS_HANDLE_RR();                                                                            \
  OS_HANDLE_TICK_HOOK();                                                                     \
}

/*********************************************************************
*
*       Trace support (OSTrace.c)
*
**********************************************************************

Trace support is enabled by defining OS_TRACE 1.
This is automatically done, when OS_LIBMODE_T is defined.

*/

#if OS_TRACE
  /* Declare trace function prototypes */
  void OS_TraceVoid (OS_U8 id);
  void OS_TracePtr  (OS_U8 id, void* p);
  void OS_TraceData (OS_U8 id, int v);
  void OS_TraceDataPtr (OS_U8 id, int v, void*p);
  void OS_TraceU32Ptr  (OS_U8 id, OS_U32 p0, void*p1);
  void OS_TraceEnable(void);
  void OS_TraceDisable(void);
  void OS_TraceEnableAll(void);                              /* OSTrace1.c */
  void OS_TraceDisableAll(void);                             /* OSTrace1.c */
  void OS_TraceEnableId(OS_U8 id);                           /* OSTrace1.c */
  void OS_TraceDisableId(OS_U8 id);                          /* OSTrace1.c */
  void OS_TraceEnableFilterId(OS_U8 FilterIndex, OS_U8 id);  /* OSTrace1.c */
  void OS_TraceDisableFilterId(OS_U8 FilterIndex, OS_U8 id); /* OSTrace1.c */

  /* Trace function macros, used in API functions */
  #define OS_TRACE_VOID(id)            OS_TraceVoid(id)
  #define OS_TRACE_PTR(id, p)          OS_TracePtr ((id), (p))
  #define OS_TRACE_DATA(id, v)         OS_TraceData((id), ((int) (v)))
  #define OS_TRACE_DATA_PTR(id, v, p)  OS_TraceDataPtr((id), ((int) (v)), (p))
  #define OS_TRACE_U32_PTR(id, p0, p1) OS_TraceU32Ptr((id), (p0), (p1))

  #define OS_TRACE_START()                    { OS_EnterRegion();                                  }
  #define OS_TRACE_START_VOID(id)             { OS_EnterRegion(); OS_TraceVoid((id));              }
  #define OS_TRACE_START_PTR(id, p)           { OS_EnterRegion(); OS_TracePtr((id), (p));          }
  #define OS_TRACE_START_DATA(id, v)          { OS_EnterRegion(); OS_TraceData((id), ((int) (v)));         }
  #define OS_TRACE_START_DATA_PTR(id, v, p)   { OS_EnterRegion(); OS_TraceDataPtr((id), ((int) (v)), (p)); }
  #define OS_TRACE_START_U32_PTR(id, p0, p1)  { OS_EnterRegion(); OS_TraceU32Ptr((id), (u), (p));  }
  #define OS_TRACE_END()                      { OS_LeaveRegion();                                  }

#else
  /* Replace trace functions by empty macros if trace is not enabled */
  #define OS_TraceVoid(id)
  #define OS_TracePtr(id, p)
  #define OS_TraceData(id, v)
  #define OS_TraceDataPtr(id, v, p)
  #define OS_TraceU32Ptr(id, p0, p1)
  #define OS_TraceEnable()
  #define OS_TraceDisable()
  #define OS_TraceEnableAll()
  #define OS_TraceDisableAll()
  #define OS_TraceEnableId(id)
  #define OS_TraceDisableId(id)
  #define OS_TraceEnableFilterId(FilterIndex, id)
  #define OS_TraceDisableFilterId(FilterIndex, id)
  /* Trace function macros, used in API functions. */
  /* Expand to nothing if trace is disabled       */
  #define OS_TRACE_VOID(id)
  #define OS_TRACE_PTR(id, p)
  #define OS_TRACE_DATA(id, v)
  #define OS_TRACE_DATA_PTR(id, v, p)
  #define OS_TRACE_U32_PTR(id, p0, p1)

  #define OS_TRACE_START()
  #define OS_TRACE_START_VOID(id)
  #define OS_TRACE_START_PTR(id, p)
  #define OS_TRACE_START_DATA(id, v)
  #define OS_TRACE_START_DATA_PTR(id, v, p)
  #define OS_TRACE_START_U32_PTR(id, p0, p1)
  #define OS_TRACE_END()
#endif

#if OS_PTRACE
  /*** Additional functions prototypes and defines for Percepio embOS-Trace ***/

