venkatarajasekhar/mplab-harmony/apps/rtos/embos/basic/firmware/src/rtos_config/pic32mz_ef_sk/RTOS.h
  typedef struct {
    void (*pfTraceSaveSymbol)       (void *address, const char *name);
    void (*pfTraceSaveObjectData)   (void *address, OS_U32 data);
    void (*pfTraceStoreEvent)       (int nParam, OS_U16 EventID, ...);
    void (*pfTraceStoreEvent0)      (OS_U16 EventID);
    void (*pfTraceStoreEvent1)      (OS_U16 EventID, OS_U32 param1);
    void (*pfTraceStoreEvent2)      (OS_U16 EventID, OS_U32 param1, OS_U32 param2);
    void (*pfTraceStoreEvent3)      (OS_U16 EventID, OS_U32 param1, OS_U32 param2, OS_U32 param3);
    void (*pfTraceStoreStringEvent) (int nArgs, OS_U16 eventID, const char* str, ...);
  } OS_PTRACE_FUNC;

  void OS_PTraceVoid            (OS_U16 id);
  void OS_PTracePtr             (OS_U16 id, void *p);
  void OS_PTraceData            (OS_U16 id, OS_U32 v);
  void OS_PTraceDataData        (OS_U16 id, OS_U32 v1, OS_U32 v2);
  void OS_PTracePtrData         (OS_U16 id, void *p, OS_U32 v);
  void OS_PTracePtrDataData     (OS_U16 id, void *p, OS_U32 v1, OS_U32 v2);
  void OS_PTracePtrDataDataData (OS_U16 id, void *p, OS_U32 v1, OS_U32 v2, OS_U32 v3);
  void OS_PTracePtrStr          (OS_U16 id, void *p, const char *c);
  void OS_PTraceSaveSymbol      (void* p, const char *n);
  void OS_PTraceSaveObjectData  (void* p, OS_U32 d);
  void OS_PTraceInit            (const OS_PTRACE_FUNC *p);

  #define OS_PTRACE_VOID(id)                                    OS_PTraceVoid   (id)
  #define OS_PTRACE_PTR(id, p)                                  OS_PTracePtr    ((id), (p))
  #define OS_PTRACE_DATA(id, v)                                 OS_PTraceData   ((id), ((OS_U32) (v)))

  #define OS_PTRACE_START()                                     { OS_EnterRegion();                                       }
  #define OS_PTRACE_START_VOID(id)                              { OS_EnterRegion(); OS_PTraceVoid((id));                  }
  #define OS_PTRACE_START_PTR(id, p)                            { OS_EnterRegion(); OS_PTracePtr((id), (p));              }
  #define OS_PTRACE_START_DATA(id, v)                           { OS_EnterRegion(); OS_PTraceData((id), ((OS_U32) (v)));  }
  #define OS_PTRACE_END()                                       { OS_LeaveRegion();                                       }

  #define OS_PTRACE_PTR_DATA_DATA(id, p, v1, v2)                OS_PTracePtrDataData((id), (p), (OS_U32)(v1), (OS_U32)(v2))
  #define OS_PTRACE_PTR_DATA_DATA_DATA(id, p, v1, v2, v3)       OS_PTracePtrDataDataData((id), (p), (OS_U32)(v1), (OS_U32)(v2), (OS_U32)(v3))
  #define OS_PTRACE_PTR_DATA(id, p, v)                          OS_PTracePtrData((id), (p), (OS_U32)(v))
  #define OS_PTRACE_PTR_STR(id, p, c)                           OS_PTracePtrStr(id, p, c)
  #define OS_PTRACE_START_PTR_DATA(id, p, v)                    { OS_EnterRegion(); OS_PTracePtrData((id), (p), (OS_U32)(v));                                      }
  #define OS_PTRACE_START_PTR_DATA_DATA(id, p, v1, v2)          { OS_EnterRegion(); OS_PTracePtrDataData((id), (p), (OS_U32)(v1), (OS_U32)(v2));                   }
  #define OS_PTRACE_START_PTR_DATA_DATA_DATA(id, p, v1, v2, v3) { OS_EnterRegion(); OS_PTracePtrDataDataData((id), (p), (OS_U32)(v1), (OS_U32)(v2), (OS_U32)(v3)); }
  #define OS_PTRACE_START_DATA_DATA(id, v1, v2)                 { OS_EnterRegion(); OS_PTraceDataData((id), (OS_U32)(v1), (OS_U32)(v2));                           }
  #define OS_PTRACE_DATA_DATA(id, v1, v2)                       OS_PTraceDataData((id), (OS_U32)(v1), (OS_U32)(v2));
  #define OS_PTRACE_SAVE_SYMBOL(p, n)                           OS_PTraceSaveSymbol(p, n);
  #define OS_PTRACE_SAVE_OBJECT_DATA(p, d)                      OS_PTraceSaveObjectData(p, d);
#else
  /* Replace trace functions by empty macros if trace is not enabled */
  #define OS_PTraceVoid(id);
  #define OS_PTracePtr(id, p);
  #define OS_PTraceData(id, v);
  #define OS_PTraceDataData(id, v1, v2);
  #define OS_PTracePtrData(id, p, v);
  #define OS_PTracePtrDataData(id, p, v1, v2);
  #define OS_PTracePtrDataDataData(id, p, v1, v2, v3);
  #define OS_PTracePtrStr(id, p, c);
  #define OS_PTraceSaveSymbol(p, n);
  #define OS_PTraceSaveObjectData(p, d);
  #define OS_PTraceInit(p);

  #define OS_PTRACE_VOID(id)
  #define OS_PTRACE_PTR(id, p)
  #define OS_PTRACE_DATA(id, v)
  #define OS_PTRACE_START()
  #define OS_PTRACE_START_VOID(id)
  #define OS_PTRACE_START_PTR(id, p)
  #define OS_PTRACE_START_DATA(id, v)
  #define OS_PTRACE_END()
  #define OS_PTRACE_PTR_DATA_DATA(id, p, v1, v2)
  #define OS_PTRACE_PTR_DATA_DATA_DATA(id, p, v1, v2, v3)
  #define OS_PTRACE_PTR_DATA(id, p, v)
  #define OS_PTRACE_PTR_STR(id, p, c)
  #define OS_PTRACE_START_PTR_DATA(id, p, v)
  #define OS_PTRACE_START_PTR_DATA_DATA(id, p, v1, v2)
  #define OS_PTRACE_START_PTR_DATA_DATA_DATA(id, p, v1, v2, v3)
  #define OS_PTRACE_START_DATA_DATA(id, v1, v2)
  #define OS_PTRACE_DATA_DATA(id, v1, v2)
  #define OS_PTRACE_SAVE_SYMBOL(p, n)
  #define OS_PTRACE_SAVE_OBJECT_DATA(p, d)
#endif

/*********************************************************************
*
*        RTOSInit and misc.
*
**********************************************************************

The routines declared below are available on all targets.

*/

/* Routines in RTOSInit.c */
void   OS_InitHW(void);
void   OS_Idle(void);
OS_U32 OS_ConvertCycles2us(OS_U32 Cycles);
OS_U32 OS_GetTime_Cycles(void);
void   OS_COM_Init(void);
void   OS_COM_Send1(unsigned char c);

/* Routines in OS_Error.c, delivered as source file */
void   OS_Error(int ErrCode);

OS_INTERWORK void  OS_StartASM(void);               /* RTOS ASM part   */
OS_INTERWORK int   OS_SwitchFromInt(void);          /* RTOS ASM part   */

void   OS_InitKern(void);             /* OSKern.c        */
OS_U8  OS_OnTx(void);                 /* OSComRxTx1.c, Returns 1 on last byte */
OS_INT OS_COM_GetNextChar(void);      /* OSComRxTx1.c, Returns the character to send, or -1  */
void   OS_OnRx(OS_U8 Data);           /* OSComRxTx1.c    */
void   OS_Send1(OS_U8 c);             /* not implemented */
void   OS_SendString(OS_ROM_DATA const char* s);  /* OSSend.c        */
void   OS_SendStringFast(OS_ROM_DATA const char *s);      /* No official API function */
OS_RX_CALLBACK* OS_SetRxCallback(OS_RX_CALLBACK* cb);
OS_U8  OS_EvaPacketEx(const OS_U8 pSrc[], OS_U16 SrcLen, OS_U8** pReturn);  /* OS_EvaPacketEx.c */

